aws/amazon-freertos/projects/renesas/rx65n-cloud-kit-uart-sx-ulpgn/e2studio-gcc/boot_loader/src/smc_gen/r_flash_rx/src/r_flash_group.c
#if (FLASH_HAS_SEQUENTIAL_CF_BLOCKS_LOCK == 1)
    else if (FLASH_CMD_LOCKBIT_ENABLE == cmd)
    {
        g_lkbit_mode = FLASH_LOCKBIT_MODE_NORMAL;
    }
    else if (FLASH_CMD_LOCKBIT_DISABLE == cmd)
    {
        g_lkbit_mode = FLASH_LOCKBIT_MODE_OVERRIDE;
    }
    else if (FLASH_CMD_LOCKBIT_READ == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        FLASH_RETURN_IF_BGO_AND_NO_CALLBACK;
        err = flash_lockbit_read(pLockbitCfg->block_start_address, &(pLockbitCfg->result));
    }
    else if (FLASH_CMD_LOCKBIT_WRITE == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        FLASH_RETURN_IF_BGO_AND_NO_CALLBACK;
        err = flash_api_lockbit_set(pLockbitCfg->block_start_address, pLockbitCfg->num_blocks);
    }
#endif // (FLASH_HAS_SEQUENTIAL_CF_BLOCKS_LOCK == 1)

#endif // (FLASH_CFG_CODE_FLASH_ENABLE == 1)

#if (FLASH_HAS_FCU == 1)
    else if (FLASH_CMD_CONFIG_CLOCK == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        if ((FLASH_FREQ_HI < *pFlashClkHz) || (FLASH_FREQ_LO > *pFlashClkHz))
        {
            err = FLASH_ERR_FREQUENCY;
        }
        else
        {
            speed_mhz = *pFlashClkHz / 1000000;
            if (0 != (*pFlashClkHz % 1000000))
            {
                speed_mhz++;    // must round up to nearest MHz
            }
            FLASH.FPCKAR.WORD = (uint16_t)(0x1E00) + (uint16_t)speed_mhz;
#if ((FLASH_TYPE == 4) && (MCU_DATA_FLASH_SIZE_BYTES != 0))
            FLASH.EEPFCLK = (uint8_t)speed_mhz;
#endif // ((FLASH_TYPE == 4) && (MCU_DATA_FLASH_SIZE_BYTES != 0))
        }
    }
#endif // (FLASH_HAS_FCU == 1)

#if (FLASH_IN_DUAL_BANK_MODE == 1)
    else if (FLASH_CMD_BANK_TOGGLE == cmd)
    {
        err = flash_toggle_banksel_reg();
    }
    else if (FLASH_CMD_BANK_GET == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        banksel_val = *((uint32_t *)BANKSEL_ADDR);
        *pBank = (0 == (banksel_val & BANKSWP_MASK)) ? FLASH_BANK0_FFE00000 : FLASH_BANK0_FFF00000;
    }
#endif // (FLASH_IN_DUAL_BANK_MODE == 1)

    else
    {
        err = FLASH_ERR_PARAM;
    }

    return err;
}

FLASH_SECTION_CHANGE_END /* end FLASH SECTION FRAM */
